TomAs-1226/Bezel/tab5/sdkconfig.defaults
# Catalyst Tab on the M5Stack Tab5. Values follow M5Stack's own Tab5 demo where it has one
# (docs/tab5-hardware.md); the rest are this firmware's choices.

CONFIG_IDF_TARGET="esp32p4"
# Tab5 units are silicon v1.x: 360 MHz, and an image built for v3.x won't run on them
CONFIG_ESP32P4_REV_MIN_1=y
# ESP-IDF 5.5.3 and later target v3 silicon unless told otherwise (5.5.1 doesn't know this symbol)
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_360=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# 32 MB PSRAM in the package: hex mode at 80 MHz. 200 MHz is faster but ESP-IDF 5.5 marks it
# experimental; a tablet that boots every time matters more than frame rate. Code executes from it too.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=2048
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_PTHREAD_TASK_STACK_SIZE_DEFAULT=8192

# LVGL reads tab5/lv_conf.h (passed as LV_CONF_PATH), not Kconfig
CONFIG_LV_CONF_SKIP=n

# The Tab5 BSP: two DPI frame buffers so the renderer flips on vsync instead of tearing; the
# renderer drives the panel itself, so the BSP's LVGL port stays unused
CONFIG_BSP_LCD_DPI_BUFFER_NUMS=2
CONFIG_BSP_SD_FORMAT_ON_MOUNT_FAIL=n

# The ESP32-C6 over SDIO (esp_hosted host, matching the C6's stock esp-hosted 1.4.x slave)
CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED=y
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
CONFIG_ESP_HOSTED_SDIO_4_BIT_BUS=y
CONFIG_ESP_HOSTED_SDIO_CLOCK_FREQ_KHZ=40000
CONFIG_ESP_HOSTED_SDIO_PIN_CLK=12
CONFIG_ESP_HOSTED_SDIO_PIN_CMD=13
CONFIG_ESP_HOSTED_SDIO_PIN_D0=11
CONFIG_ESP_HOSTED_SDIO_PRIV_PIN_D1_4BIT_BUS=10
CONFIG_ESP_HOSTED_SDIO_PIN_D2=9
CONFIG_ESP_HOSTED_SDIO_PIN_D3=8
CONFIG_ESP_HOSTED_SDIO_GPIO_RESET_SLAVE=15
CONFIG_ESP_HOSTED_SDIO_OPTIMIZATION_RX_STREAMING_MODE=y

# robot.local (Systemcore) and roborio-TEAM-frc.local resolve through mDNS
CONFIG_LWIP_DNS_SUPPORT_MDNS_QUERIES=y
CONFIG_LWIP_MAX_SOCKETS=16
# Two interfaces (Wi-Fi and the USB tether) both run DHCP clients, and lwIP keeps one global DNS server
# list: without this, a lease from Systemcore's dnsmasq would replace the Wi-Fi network's DNS and the
# assistant could no longer resolve api.anthropic.com. With it, DNS follows the default netif (Wi-Fi).
CONFIG_ESP_NETIF_SET_DNS_PER_DEFAULT_NETIF=y

# HTTPS for the assistant: every mbedTLS allocation (the 16 KB record buffers, the handshake) in PSRAM, so
# a TLS session leaves internal RAM to Wi-Fi, USB and the task stacks; the full CA bundle in flash for
# esp_crt_bundle_attach (~65 KB, and no guessing which root a CDN moves to)
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# The USB tether: the enumeration filter lets a Realtek adapter come up in its CDC-ECM configuration;
# RNDIS control responses (OID queries) are up to 1025 bytes, and iot_usbh_rndis refuses to build with
# iot_usbh_cdc's default 256-byte control buffer
CONFIG_USB_HOST_ENABLE_ENUM_FILTER_CALLBACK=y
CONFIG_USBH_CDC_CONTROL_TRANSFER_BUFFER_SIZE=1025

# IRAM and the small-data section share the 183 KB below 0x4FF2CBD0 (sram_low), and LVGL's
# LV_ATTRIBUTE_FAST_MEM loops already take ~67 KB of it; the USB host's DWC interrupt path (~1.8 KB, always
# in IRAM) overflowed it. Heap functions and ISR-side event posting move to flash instead: nothing in this
# firmware allocates memory or posts an event from an IRAM-safe interrupt while the cache is off.
CONFIG_HEAP_PLACE_FUNCTION_INTO_FLASH=y
CONFIG_ESP_EVENT_POST_FROM_IRAM_ISR=n

# Camera: SC2356 driven as SC202CS, 1280x720 RAW8 through the ISP
CONFIG_CAMERA_SC202CS=y
CONFIG_CAMERA_SC202CS_MIPI_RAW8_1280X720_30FPS=y
CONFIG_CAMERA_SC202CS_MIPI_DEFAULT_FMT_RAW8_1280X720_30FPS=y

CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_VFS_FSTAT_BLKSIZE=4096

# A crash leaves a core dump in flash; the next start reads its summary (task, address) onto the boot
# screen and into <sd>/catalyst-boot.txt, then erases it
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y
CONFIG_ESP_COREDUMP_CHECKSUM_CRC32=y
